package sprint_04.inheritance.lesson_8;

public class Main {
    /*
    Что вы узнали
Вы прошли ещё одну непростую тему. Поздравляем! Вот что вы узнали:
Благодаря наследованию дочерние классы автоматически приобретают функционал класса-родителя. Не нужно раз за разом прописывать одни и те же поля и методы — их можно передать по наследству.
У классов в Java может быть сколько угодно предков, но только один родитель. То есть при помощи ключевого слова extends можно наследовать только от одного класса.
В экземплярах суперкласса нельзя использовать поля и методы подклассов. Если у классов-наследников появились новые свойства и функционал, то передать их в класс-родитель не получится.
Чтобы изменить поведение метода суперкласса, его можно переопределить внутри подклассов. Переопределение метода помечается в коде с помощью аннотации @Override.
Ключевое слово super позволяет вызвать метод или конструктор суперкласса, а также обратиться к его полям.
Слово this позволяет обратиться к полю, методу или конструктору класса внутри него самого.
Также вы узнали, что автоматическая генерация кода в IDEA позволяет добавить в код конструктор, get- и set-методы или переопределить метод. Для автогенерации кода используют следующие комбинации:
Alt+Insert — для Windows и Linux;
⌘+N, Ctrl+Enter — для macOS.
Наследование позволяет классам наследовать свойства и методы от других классов. Этот принцип ООП делает процесс разработки проще и помогает коду становиться более лаконичным. Однако важно тщательно продумывать иерархию классов и использовать наследование только тогда, когда это действительно необходимо.
В противном случае вы можете столкнуться с ошибками, которые в целом называют «Ошибки хрупкого базового класса». Наследуя класс ради полезных методов, вы рискуете получить неработоспособный код при малейшем изменении в суперклассе.
     */
}
