Компания «Собираем и перерабатываем» занимается переработкой вторсырья. Она планирует провести акцию: за каждый собранный килограмм вторсырья будут начисляться бонусы. 1 бонус = 1 рубль. Их можно потратить в магазинах партнёров.
Для привлечения внимания к акции, компания решила создать чат-бот, в котором можно будет:
посмотреть карту с пунктами приёма вторсырья,
проверить по коду на упаковке, подходит ли материал для переработки,
а также рассчитать количество бонусных баллов.
Ваша задача — создать этот чат-бот.